---
kind: other
id: Properties.T:Autodesk.Revit.DB.ModelCurveArrArrayIterator
source: html/56c241b9-b06c-a1ab-9b2e-557ef73c41ef.htm
---
# ModelCurveArrArrayIterator Properties

Retrieves the item that is the current focus of the iterator.